<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Sistema Processa Open Source - E.R.P.</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
.style2 {
	font-size: 24px;
	font-family: Arial, Helvetica, sans-serif;
}
-->
</style>
</head>

<body>
   <div align="center">
     <p class="style2"><strong>Vers&atilde;o 1.0.7.1</strong>
       </p>
     </p>
     <p>&nbsp;     </p>
   </div>
   <div align="justify"><font size="3" face="Verdana, Arial, Helvetica, sans-serif">
  A nova vers&atilde;o do <strong>Sistema Processa Open Source E.R.P.</strong> 
  est&aacute; caracterizada pela convers&atilde;o das telas de manuten&ccedil;&atilde;o das tabelas auxiliares e corre&ccedil;&atilde;o de bugs nas principais telas de cadastros (Clientes e Produtos). Veja as principais altera&ccedil;&otilde;es:
  <ol>
    <li> M&oacute;dulo de Gerenciamento do Sistema (SysMan): </li>
    <ul>
      <li>O cadastro de operadores &eacute; agora parte integrande da tela de gerenciamento de acessos;</li>
      <li>Corre&ccedil;&atilde;o no gerador de relat&oacute;rios que n&atilde;o criava novo relat&oacute;rio.</li>
    </ul>
    <li>
      M&oacute;dulo de Gerenciamento de Cadastros (SysCad):    </li>
    <ul>
      <li>O Cadastro geral n&atilde;o inclu&iacute;a novos Aliases na tabela de Tipo de Aliases (Apelidos);</li>
      <li>Melhor gerenciamento na escolha do tipo de cadastro (Pessoa F&iacute;sica, Jur&iacute;dica, Estrangeiro, etc...)</li>
      <li>Busca por categoria de cadastros (Clientes, Fornecedores, Funcion&aacute;rios, etc.);</li>
      <li>Busca de registros diretamente na grade pelo campo onde est&aacute; marcada a ordena&ccedil;&atilde;o dos registros; </li>
      <li>Convers&atilde;o das telas das tabelas auxiliares com exce&ccedil;&atilde;o de Pa&iacute;ses, Estados, Munic&iacute;pios, Bairros, Tipos de Endere&ccedil;os e Logradouros, o qual ser&aacute; entregue na pr&oacute;xima vers&atilde;o em tela &uacute;nica e com suporte a convers&atilde;o da base de Ceps do IBGE.</li>
    </ul>
    <li> M&oacute;dulo de Gerenciamento Cont&aacute;bil; 
      <ul>
        <li>Convers&atilde;o da manuten&ccedil;&atilde;o da Tabela de impostos e al&iacute;quotas para cada estado cadastrado no sistema, agora com total visualiza&ccedil;&atilde;o e preenchimento em TreeView.</li>
      </ul>
    </li>
    <li> M&oacute;dulo de Estoques: </li>
    <ul>
      <li>Convers&atilde;o das telas de manuten&ccedil;&atilde;o das tabelas auxiliares; </li>
      <li>Consertado bug de n&atilde;o cadastramanento de v&iacute;nculo a fornecedores inclusive com pr&eacute; c&aacute;lculo do pre&ccedil;o de custo do fornecedor;</li>
      <li>Mostrando cardex do produto com legenda em cores da opera&ccedil;&atilde;o realizada;</li>
      <li>Busca de registros diretamente na grade pelo campo onde est&aacute; marcada a ordena&ccedil;&atilde;o dos registros; </li>
      <li>Ordena&ccedil;&atilde;o da grade por qualquer campo clicando na coluna que se quer ordenar;</li>
      <li>Disposi&ccedil;&atilde;o de mais campos na grade de busca.</li>
    </ul>
    <li>M&oacute;dulo Configurador de Produtos:    </li>
    <ul>
      <li>Convertidas as telas de manuten&ccedil;&atilde;o de Tipos de Componentes, Acabamentos e Refer&ecirc;ncias, sendo que a &uacute;ltima fica integrada com a anterior.</li>
    </ul>
    </ol>
  <p><strong>Funcionalidades da Pr&oacute;xima vers&atilde;o:</strong></p>
  <ol>
    <li>Convers&atilde;o do m&oacute;dulo de pedidos:</li>
    <li>Programa para gigita&ccedil;&atilde;o das Notas de Entrada com c&aacute;lculo dos custos parametrizado; </li>
    <li>Gera&ccedil;&atilde;o e impress&atilde;o de Notas Fiscais;</li>
    <li>Vers&atilde;o beta do PDV;</li>
    <li>Vers&atilde;o beta do Financeiro com suporte a Bancos e Caixas com fluxo e concilia&ccedil;&atilde;o.</li>
    </ol>
  <p>Alcindo Schleder - Equipe Sistema Processa Open Source</p>
</div>
</body>
</html>
